Tekla Open API Reference for Tekla Structures 2025
LineAttributes Properties
The Line.LineAttributes type exposes the following members.
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the open graphic object. The end points of an open graphic object can contain arrowheads.
 (Inherited from OpenGraphicObject.OpenGraphicObjectAttributes.)
Line
 The line attributes of the graphic object. A graphic object always consists of lines.
 (Inherited from GraphicObject.GraphicObjectAttributes.)
Top
See Also
Reference
Line.LineAttributes Class
Tekla.Structures.Drawing Namespace